[{"title":"三国争霸","date":"2017-05-16T14:34:26.000Z","path":"2017/05/16/TeamBuilding/","text":"不变的初心 为了拉近各团队的距离，增加同事间友谊，使部门间磨合更融洽，让员工在工作之余放松身心，享受大自然的怡人风光，公司特地组织了一次“无锡破冰行动之三国争霸”的活动。此次活动不仅丰富了员工的业余生活，增强了部门之间的沟通协作，更让爱奇艺游戏事业部这个大家庭更加和谐，从而更好的提升了企业的凝聚力，充分展现了公司的团队精神。 上午十点半到达下榻的酒店-花园大酒店，一个如走进花园式的酒店。下车后并没有直接办理入住，而是进行了破冰项目之前的热身运动，游戏分组。 先是男女依次间隔手拉手围城一个大圈，听从裁判长的指挥，喊着口号将肘、脸、屁股按照裁判报出的随机数字进行“粘合”抱团，没有抱团成功的人员将接受特殊的表演。之后女生围城一个小圈，男生围城一个大圈在女生外面，依次报数，只报1-10，之后依次循环，报到相同数字的同学组成一个队，这样可以保证最大程度随机化组内成员，让我们尽可能多得接触到其他部门的同事。 最后我们被分成了十个小队，分别是绝不滑水、金屋藏娇、嘎德莱克 、王土之兵、老司机、猥琐发育、漕河泾杀马特、良心 、欧皇。队的属性是根据五行金、木、水、火、土划分，相生相克，两队共享同一属性。至此，下午三国争霸赛前厮杀准备活动已然就绪。 时间变成下午两点半，裁判介绍下午厮杀游戏规则，由工作人员提前将100个百宝箱和100把钥匙图藏于三国遗址公园各个景点处，每个队根据地图同时去寻找，找到分别对应的钥匙图和百宝箱后找每对随队的裁判开启宝箱，获取里面对应的积分卡或者完成里面规定的任务获取更高积分。 相生的两队相遇，可商量交换彼此有用的钥匙。相克的两队如果相遇，克队可以强行与被克队PK，如果赢了，可带走他们一件道具，若输了，可拍拍屁股闪人，不用负任何责任。我们对于此项游戏规则上瘾至死，整个景区可时常发现一大波穿着一种颜色衣服的人在追杀另外一种颜色衣服的人，这场面绝对不亚于奔跑吧兄弟中撕名牌环节。同时也是这项规则害的我们整整一下午都在紧张奔跑中躲避追杀，就为了保护手中法器不被对手生吞，好一个相生相克。 我们从上午团队间合作默契度为10瞬间飙到了120。从不太言语变成大喊惊叫（通知同伴敌人来袭）。从相互推让队长到争先恐后寻找宝盒。爱奇艺游戏事业部那些原来的配方在无锡三十三度的烈日下再次发酵成原来的味道。这种团队活动会给你留下永恒不变的回忆。 在前进的道路上，虽然困难重重，依旧抵挡不住我们一颗进取的心，正所谓雄关漫道真如铁，而今迈步从头越。曾经的我们意气风发，曾经的我们锋芒毕露，曾经的我们试图号令天下，如今我们变的更加稳重成熟，知道如何更加有效保存实力聚焦重点，清楚未来的梦想需要大家一起才能实现。 变的是时间，不变的是初心。","comments":true,"tags":[{"name":"随笔","slug":"随笔","permalink":"https://hongyu315.github.io/tags/随笔/"}]},{"title":"Objective-c 编码规则","date":"2017-05-06T07:34:35.000Z","path":"2017/05/06/Objective-c-编码规则/","text":"排版规范 缩进使用4个空格，在Xcode &gt; Preferences &gt; Text Editing将Tab和自动缩进都设置为4个空格。 每一行的最大长度设置为80，在Xcode &gt; Preferences &gt; Text Editing &gt; Page guide at column:中将最大行长设置为80，过长的一行代码将会导致可读性问题。 方法大括号和其他大括号(if/else/switch/while等)总是在同一行语句打开但在新行中关闭。 在-和(void)之间应该有一个空格，第一个大括号{的位置在函数所在行的末尾，同样应该有一个空格。 如果一个函数有特别多的参数或者名称很长，应该将其按照:来对齐分行显示。 命名规范 类名 ：首字母大写；标示出类型，如果是viewController，统一以ViewController、VC结尾（这种也可以）。 变量常量名：应该使用驼峰式命名规则，所有的单词首字母大写和加上与类名有关的前缀。 善用枚举：目前项目中有部分界面需要传递type的，为string类型，无论判断还是传值，其实都不是特别好，建议后续优化为枚举，更清晰与直观 。 方法：方法名尽量直观，各个参数也尽可能明确出意思（比如pageIndex、rowIndex等等）。 宏定义：一定要精确，宁可长，不要省。 属性：也是使用驼峰式，但首单词的首字母小写。对属性使用auto-synthesis，而不是手动编写@ synthesize语句，除非你有一个好的理由。 编码规范 类名以大写字母开头，应该包含一个名词来表示它代表的对象类型，同时可以加上必要的前缀，比如NSString, NSDate, NSScanner, NSApplication等等。 协议名称应该清晰地表示它所执行的行为，而且要和类名区别开来，所以通常使用ing词尾来命名一个协议，比如NSCopying,NSLocking。 不要使用单词的简写，拼写出完整的单词。 = 两边各一个空格。 @public和@private标记符应该以一个空格来进行缩进。 方法名的+和-之后空出一格。 善用#pragma mark。 在书写协议的时候注意用&lt;&gt;括起来的协议和类型名之间是没有空格的，比如IPCConnectHandler(),这个规则适用所有书写协议的地方，包括函数声明、类声明、实例变量等等。 较短的block可以写在一行内。如果分行显示的话，block的右括号}应该和调用block那行代码的第一个非空字符对齐。block内的代码采用4个空格的缩进。如果block过于庞大，应该单独声明成一个变量来使用。^ 和(之间，^和{之间都没有空格，参数列表的右括号)和{之间有一个空格。 构造字典时，字典的Key和Value与中间的冒号:都要留有一个空格。 当引用的是一个Objective-C的头文件时，使用#import，当引用的是一个C或者C++的头文件时，使用#include，这时必须要保证被引用的文件提供了保护域（#define guard）。 BOOL在Objective-C中被定义为signed char类型，这意味着一个BOOL类型的变量不仅仅可以表示YES(1)和NO(0)两个值，所以永远不要将BOOL类型变量直接和YES比较。 在init和dealloc中不要用存取方法访问实例变量。 按照定义的顺序释放资源。 Delegate要使用弱引用。 注释规范 每一个文件都必须写文件注释。 所有实体model内各个变量，变量要带有说明。 类中的变量，如果有特殊用途的（比如有个dictionary做缓存），注释出大概用途。 对外提供的方法，方法中不直观的参数做注释。","comments":true,"tags":[{"name":"Objective-c","slug":"Objective-c","permalink":"https://hongyu315.github.io/tags/Objective-c/"}]},{"title":"2017年度计划","date":"2017-04-16T04:15:16.000Z","path":"2017/04/16/2017计划/","text":"建立个人网站 开发一款私人APP（android和iOS） 坚持每周写一篇文章 学习React Native 学习Tensorflow 减肥至130斤 读完4本书（从0到1、关键对话、联盟、经济学通识） 提高 objective-c 、swift语言掌握程度 整理出objective-c、swift编码规范","comments":true,"tags":[{"name":"随笔","slug":"随笔","permalink":"https://hongyu315.github.io/tags/随笔/"}]},{"title":"感悟","date":"2017-04-12T15:19:33.000Z","path":"2017/04/12/感悟/","text":"敢于介绍自己，乐于推销自己 分享有助于帮助自己梳理知识点 做任何事情都需要积极主动 错了及时承认 拒绝暧昧 真心帮助别人 认真聆听别人说话","comments":true,"tags":[{"name":"随笔","slug":"随笔","permalink":"https://hongyu315.github.io/tags/随笔/"}]}]